configs/runs/hidden_bench/hidden_bench_imitation_reasoning_control_task_grid.yaml
# Multi-task grid version of hidden_bench_imitation_reasoning_control_10.yaml:
# the same v2 controlled reasoning run, swept over game.options.task_id **and**
# over the two feedback controllers.
#
# Cells: 14 tasks x 2 control mechanisms = 28.
#
# Every task listed in the grid has one threshold_target cell and one
# soft_target cell.
#
# The control axis is the one this grid was extended for. `threshold_target`
# decides its action from the sampled target share; `soft_target` draws it from
# a sigmoid of the same comparison, so both actions occur in comparable
# population states. That is what makes
#
#   target_actuation_cmi = I(U_t; n_Z(t+1) | n_Z(t))
#
# estimable: under the deterministic policy the extreme conditioning slices see
# only one action and contribute nothing, however many episodes are run. See
# section 3.4.1 of docs/documentation/hidden_bench/hidden_bench_imitation.md,
# and the provider-free smoke check
# configs/runs/hidden_bench/hidden_bench_imitation_classical_soft_control_smoke.yaml
# where the same swap took events-in-single-action-slices from 31.7% to 0%.
#
# Everything except the policy is held matched across the two control arms -
# same tasks, seeds, horizon, target, sensor sample size, threshold, and
# controller text version - so a difference between the arms is attributable to
# the policy and nothing else.
#
# Adapting a single-task run into a task grid means every field that named
# that task's own answer strings by hand has to go, because those strings are
# wrong for every other task in the grid:
#   - prompt.response_contract has no `allowed_values`. The game derives the
#     real options from each task's own `possible_answers` in the corpus at
#     run time (src/mas_cc/games/hidden_bench/imitation/game.py). This
#     mirrors hidden_bench_imitation_reasoning_control_company_acquisition.yaml,
#     the existing precedent for swapping in a task without knowing its
#     options ahead of time.
#   - game.options.initialization is omitted, so initialization_mode
#     defaults to `local_vote`: with dynamics_mode: reasoning that means each
#     agent's initial vote comes from its own LLM call instead of a
#     hardcoded initial_votes list (which would otherwise need to name each
#     task's exact option strings, and can't - the single-task v2 run used
#     [East Town, East Town, North Hill, West City], valid only for
#     evacuation_north_hill).
#   - control.options.target: correct still resolves to each task's own
#     correct_answer, also never typed here.
#
# Cost/design consequence of that: the single-task run staged both truth
# support and controller-target support at exactly 1/4 for free (explicit
# initial_votes cost 0 provider calls). local_vote instead spends
# population_size (4) extra provider calls per episode so agents cast a
# genuine first vote from their own private evidence - not the same start
# condition, and slightly more expensive. Budget below is scaled for that.
#
# Run this from a terminal. First enter the repository (change this path if your
# checkout lives somewhere else):
#   cd /home/cesarali/LanguageGames/MA-CC
#
# The commands below use the MA-CC Conda environment without requiring you to
# activate it. `--no-capture-output` is important: it keeps logs, progress bars,
# provider errors, and the final result path visible while the command runs.
# Make sure the repository-root .env contains POTSDAM_API_KEY and
# BASE_POTSDAM_LLM_URL before launching.
#
# 1. Check availability, pricing, request counts, and budget (no model calls):
#   conda run -n MA-CC --no-capture-output python -m mas_cc.cli.main experiment preflight \
#     --config configs/runs/hidden_bench/hidden_bench_imitation_reasoning_control_task_grid.yaml \
#     --output-dir results/inspection/hidden_bench_imitation_reasoning_control_task_grid_preflight
#
# 2. Run all cells with live console output:
#   conda run -n MA-CC --no-capture-output python -m mas_cc.cli.main experiment run \
#     --config configs/runs/hidden_bench/hidden_bench_imitation_reasoning_control_task_grid.yaml \
#     --output-dir results
#
# The run performs its own fresh pricing and runtime-budget checks. The optional
# --approve-preflight flag is intentionally omitted here because live pricing
# metadata currently changes the approval fingerprint between the two commands.
llm_provider:
  type: university
  model: gwdg/qwen3-30b-a3b-instruct-2507
  credentials_env: POTSDAM_API_KEY
  base_url_env: BASE_POTSDAM_LLM_URL
  # A 30B model behind a shared proxy at concurrency 10 needs well over 60s in
  # the tail.  Run ...-v2-20260840 died on exactly this: the last good call at
  # 10:56:04, the timeout at 10:57:01, 57 seconds later.  The deadline has to
  # cover generating `max_output_tokens`, not the median reply.
  timeout_seconds: 180
  max_retries: 2
  request_concurrency: 10
  temperature: 0.0
  # Sized for v2, not v1.  v2 replies cite a fact and state a vote, and the
  # private history grows every event, so they run 100-130 tokens by the tenth
  # round where v1 ran 60-80.  At 128 the focal_update JSON was truncated with
  # no closing brace, which the vote contract correctly rejects; discussion
  # turns were cut mid-sentence silently, which corrupts the disclosure
  # measurement instead of failing loudly.
  #
  # 256 is ~2x the longest observed valid reply.  Do not raise this without
  # raising timeout_seconds with it: the cap bounds how long one generation can
  # take, so a large cap converts truncation failures into timeout failures.
  # It also feeds preflight's conservative request bound, so a very large value
  # makes the budget line below stop being a real guard.
  max_output_tokens: 256
  options:
    estimated_latency_seconds: 3.0
prompt:
  schema_version: 2
  prompt_family: hidden_bench_imitation_update
  # v2 (1 of 4).  Must equal game.options.prompt_version; the run refuses to
  # start otherwise, because preflight prices whatever this section names.
  prompt_version: 2
  response_contract:
    type: hidden_bench_json_vote
game:
  type: hidden_bench_imitation
  population_size: 4
  # Whole population sweeps; 13 sweeps replace the former 50-attempt partial run.
  horizon: 13
  topology: complete
  options:
    task_set: vanilla
    # Swept below in `grid:`. This base value is only what the pre-grid
    # validation pass in config/grid.py binds against; every real cell uses
    # one of the grid values instead.
    task_id: evacuation_north_hill
    profile: hidden
    assignment_scheme: bijective
    dynamics_mode: reasoning
    pairing: uniform_two_distinct
    messages_per_agent: 1
    # memory_size 0 means "all of it".  Under v2 the agent finally sees its own
    # past messages in that history, which is what makes "mention something you
    # have not mentioned yet" a followable instruction (doc section 1.3).
    memory_size: 0
    allow_relay: true
    # v2 (2 of 4).  Longer replies, one new fact per turn, an explicit stated
    # vote, and a history that no longer says "partner/controller".
    prompt_version: 2
    # v2 (3 of 4), doc section 1.2 - the paper's "Informing Asymmetry" arm.
    # Set to true to tell agents information is unevenly held.  It never marks
    # *which* facts are unique; that would end the hidden-profile task.
    inform_asymmetry: false
    # doc section 1.5.  1 keeps the canonical coordination bonus, which is this
    # study's imitation coupling strength written in English.  2 removes it.
    scenario_variant: 1
    stop_on_consensus: false
    classical:
      kernel: irisarri_multi_opinion
      forward_rate: 1.0
      reverse_rate: 1.0
      interaction_factor: destination_count_plus_offset
      interaction_offset: 1.0
      control_strength: 2.0
control:
  # Swept below in `grid:`, like task_id above. This base value is only what the
  # pre-grid validation pass binds against.
  mechanism: threshold_target
  # Shared by both control arms, which is the point: the two cells of a task row
  # differ in the policy and in nothing else.
  options:
    target: correct
    sensor_sample_size: 2
    # `policy` is deliberately absent. It is an audit echo that must equal the
    # mechanism's own name, so a hardcoded `threshold_target` here would be
    # rejected outright by the soft_target cells. Omitted, it defaults to
    # whichever mechanism the grid bound, which is what a swept axis needs.
    threshold: 0.5
    # Inverse policy temperature for soft_target: P(ADVOCATE_Z) =
    # sigma[beta * (threshold - sampled target share)]. Large beta converges on
    # threshold_target, so 4.0 is chosen to be clearly softer than that while
    # still tracking the population. A first-experiment value, not a tuned one.
    # The threshold_target cells ignore this field.
    beta: 4.0
    # v2 (4 of 4), doc section 2.  1 announces "the external controller"; 2
    # speaks as an ordinary peer, arguing from the shared facts only, drawn
    # from a four-paraphrase bank whose ID is logged per event.
    #
    # Held at 2 for BOTH arms, overriding soft_target's own default of 3. The
    # default exists to keep U_t -> M_t deterministic when the policy is
    # random; here matching the arms matters more, because a controller-text
    # difference between them would confound exactly the contrast this grid is
    # measuring. It also keeps these cells comparable with every earlier v2 run.
    template_version: 2
execution:
  seed: 20260850
  repetitions: 100
  parallelism: 10
  fail_fast: false
pricing:
  mode: live
  max_age_seconds: 600
  require_fresh_at_launch: true
  fallback_policy: deny
  explicit_unknown_price_override: false
budget:
  # Sized for the whole grid (3 task_id x 2 control mechanisms = 6 cells), not
  # one cell - scaled 6x off the single-task run's budget, plus headroom for the
  # extra population_size (4) local_vote calls per episode. Doubled from the
  # task-only version of this grid when the control axis was added; the two
  # control arms cost the same, because a controller message is assembled
  # locally and never costs a provider call in either arm. Re-check with
  # `experiment preflight` before raising `repetitions` or either axis.
  #
  # This grid is the one results/DIAGNOSIS.md is about. Its earlier revision
  # carried `max_input_tokens: 250000000`, hit it during cell 0001 of 50, and
  # then failed 4,235 episodes on refused calls. The token/request limits are
  # gone: with `memory_size: 0` every prompt carries the whole interaction
  # history, so no pre-launch token estimate can be right, and cost is the
  # only ceiling worth stopping on.
  accounting_unit: proxy_accounting_unit
  system_max_cost_per_run: 300.0
  max_cost_per_run: 300.0
  live_spend_poll_seconds: 120
  allow_unbounded_paid_requests: false
logging:
  level: INFO
  console: true
  audit: true
  # MASTER LOGGING, SWITCH 1 of 2: ON / OFF.
  comet: true
  options:
    show_metrics: true
    prompt_examples:
      # One deterministic early/late sample for the completed cell, not one
      # prompt file per round in every episode.
      count: 2
      scope: cell
storage:
  output_dir: results
  format: jsonl
  artifact_profile: results_only
  checkpoint_mode: episode
  overwrite: true
  wipe_and_recompute: true
analysis:
  # Run all across-episode sensing/control information channels automatically,
  # together with the controller diagnostics that make them readable. Results
  # are written below the run directory as a human-readable report in
  # hidden_bench_imitation_analysis/information_estimates.md, with the machine
  # -readable tables beside it as information_estimates.csv and
  # support_diagnostics.csv.
  #
  # Nothing here is a hidden default: every quantity the run should compute is
  # named in the list below.
  enabled: true
  estimators:
    # The count-vector channels: the sensor and the action measured against the
    # full occupation state N_t.
    - sensing_mi
    - population_actuation_cmi
    - target_actuation_cmi
    - focal_actuation_cmi
    # The same two questions asked against the macroscopic order parameters
    # instead of N_t.  Each order parameter is recorded as the integer headcount
    # it is a strictly monotone function of, so the estimate is exactly the one
    # you would get from the float without the float-equality hazard:
    #   m_ctrl  <-> count on the controller's target option
    #   m_truth <-> count on the correct answer
    #   m_order <-> the largest count over options (consensus, whichever option)
    # These coarsen a 14-state alphabet to a 5-state one, which is the direct
    # remedy for the conditioning-slice collapse documented in
    # docs/documentation/imitation_mutual_information.md section 8.
    # Note m_ctrl_actuation_cmi is target_actuation_cmi under a second name:
    # identical by construction, kept so the order-parameter family is complete.
    - sensing_mi_m_ctrl
    - sensing_mi_m_truth
    - sensing_mi_m_order
    - m_ctrl_actuation_cmi
    - m_truth_actuation_cmi
    - m_order_actuation_cmi
    # ---------------------------------------------------------------------
    # Controller entropy / available action information.
    #
    # Every actuation CMI above is bounded by the controller's own remaining
    # action entropy in the same conditioning space:
    #
    #   I(U_t; X_(t+1) | S_t)  <=  H(U_t | S_t)
    #
    # so a near-zero CMI has two readings - the controller barely moved the
    # population, or it had almost no action freedom left once S_t was known.
    # These entropies are the ceiling, and are what tell the two apart. They
    # are the reason this grid sweeps threshold_target against soft_target at
    # all: the deterministic policy is expected to put H(U_t | N_t) at ~0.
    - controller_action_entropy
    - controller_action_entropy_given_population
    - controller_action_entropy_given_m_ctrl
    - controller_action_entropy_given_m_truth
    - controller_action_entropy_given_m_order
    # ---------------------------------------------------------------------
    # Actuation information fractions: each CMI over its own ceiling above.
    # Reported as NaN, never 0, when the denominator vanishes - the ratio is
    # undefined there rather than small - and never clipped to [0, 1], so an
    # estimator pathology stays visible. A normalization diagnostic; not an
    # efficiency, and not to be described as one.
    - population_actuation_information_fraction
    - m_ctrl_actuation_information_fraction
    - m_truth_actuation_information_fraction
    - m_order_actuation_information_fraction
    # ---------------------------------------------------------------------
    # Signed behavioral actuation. CMI is unsigned: it cannot say whether the
    # population moved toward the controller's target or away from it. These
    # are state-adjusted ADVOCATE_Z-minus-NO_OP contrasts, taken only inside
    # conditioning states that saw both actions (the policy depends on the
    # state, so an unconditional difference of means would mostly measure
    # which states each action is taken in). m_truth is the one to watch under
    # a wrong target: controller success and epistemic success can disagree.
    - m_ctrl_signed_actuation
    - m_truth_signed_actuation
    - m_order_signed_actuation
    # ---------------------------------------------------------------------
    # Action-overlap diagnostics, one per conditioning representation. The
    # headline number is the fraction of events sitting in states where both
    # actions were observed - the only events that can support a within-state
    # comparison at all. This is the direct measurement of the effect the
    # control axis of this grid was added to produce, and a nonzero
    # controller_action_entropy is NOT a substitute for it.
    - population_action_overlap
    - m_ctrl_action_overlap
    - m_truth_action_overlap
    - m_order_action_overlap
  options:
    bootstrap_resamples: 1000
    null_permutations: 1000
    confidence: 0.95
    seed: 20260813
  # Upload information_estimates.md to Comet as a run asset once analysis
  # finishes. Only takes effect when logging.comet (the master switch) is on.
  comet_export: true
metrics:
  enabled: true
  # Parallel episodes have independent interaction timelines. Record their
  # metrics locally, but do not stream any per-episode series to Comet.
  comet_export: []
aggregation:
  schema_version: 1
  forward_fill: absorbing
  relabel_by_winner: false
  percentiles: [10, 50, 90]
  rolling_window: 1
  # Once all episodes finish, aggregate only the population-order trajectories
  # needed to assess consensus and target/truth alignment.
  cell_metrics:
    - m_ctrl
    - m_truth
    - m_order
    - population_action_share_per_option
    - dominant_action_share
  sweep_metrics: []
  horizons: [1]
  null_permutations: 0
observability:
  schema_version: 1
  comet:
    # -------------------------------------------------------------------
    # MASTER LOGGING, SWITCH 2 of 2: SHAPE. Only read when comet: true.
    # -------------------------------------------------------------------
    writer: master_only
    heartbeat_seconds: 20
    progress_metrics: [episodes_done]
    # Re-render the grid picture every N finished episodes. Comet's Image Panel
    # steps through same-named images, so this scrubs as an animation of the
    # grid filling in.
    grid_image_every_n_episodes: 5
    sweep_experiment: true       # false = no liveness dashboard
    # Everything for this run lands on the one master experiment: the grid
    # image above, every cell's curves, its metric PNGs as that cell finishes,
    # and the post-run information report. One link to open rather than eight.
    #
    # The cost of `master`, and it is a real one: cell series are prefixed with
    # the cell id to keep six cells from colliding, so the curve is
    # `cell-0000_m_ctrl` and its image `metric_plot_cell-0000_m_ctrl` - not the
    # bare `m_ctrl` a single-cell run produces. `cells/cell-000N/` on disk and
    # `grid_summary.json` both say which cell is which.
    #
    # Switch to `experiments` to get one child experiment per cell with bare
    # metric names, which is what lets Comet overlay threshold_target against
    # soft_target on one chart.
    cell_reporting: master
    # Upload the locally rendered aggregate metric PNGs (m_order, m_ctrl,
    # m_truth, dominant_action_share, and the per-option share plots). They are
    # sent once per cell, when that cell's last episode lands.
    metric_plots: true
experiment:
  # Renamed when the control axis was added. The task-only version of this grid
  # has already run to completion under the old name, and `wipe_and_recompute`
  # below deletes the run directory it matches - so reusing the name would
  # destroy those results rather than sit beside them.
  name: hidden-bench-imitation-reasoning-control-task-control-grid-v2
  description: Controlled reasoning episodes under the v2 prompt and peer-style controller text, swept across HiddenBench tasks and across the deterministic and soft feedback controllers.
  tags: [hidden-bench, imitation, reasoning, control, soft-target, diagnostics, prompt-v2, task-grid]
grid:
  game.options.task_id:
    - "evacuation_west_city"
    - "Antarctic Storm Safe Haven"
  control.mechanism:
    - threshold_target
    - soft_target